In [1]:
import numpy as np
import pandas as pd

In [2]:
data=['harry','ravisha','preet','sanjana','arjun']
[i.capitalize() for i in data]

['Harry', 'Ravisha', 'Preet', 'Sanjana', 'Arjun']

In [3]:
[i.upper() for i in data]

['HARRY', 'RAVISHA', 'PREET', 'SANJANA', 'ARJUN']

In [4]:
# if data contains any null values then that will give error
data[0]=None
data

[None, 'ravisha', 'preet', 'sanjana', 'arjun']

In [6]:
# [i.captialize() for i in data]
# it gives error so run it for your query

In [7]:
data[0]='peter parker'
data

['peter parker', 'ravisha', 'preet', 'sanjana', 'arjun']

In [8]:
names=pd.Series(data)
names

0    peter parker
1         ravisha
2           preet
3         sanjana
4           arjun
dtype: object

In [9]:
# string funtions in pandas
names.str.capitalize()

0    Peter parker
1         Ravisha
2           Preet
3         Sanjana
4           Arjun
dtype: object

In [10]:
names.str.upper()

0    PETER PARKER
1         RAVISHA
2           PREET
3         SANJANA
4           ARJUN
dtype: object

In [11]:
names.str.lower()

0    peter parker
1         ravisha
2           preet
3         sanjana
4           arjun
dtype: object

In [12]:
names.str.title()

0    Peter Parker
1         Ravisha
2           Preet
3         Sanjana
4           Arjun
dtype: object

In [13]:
print('''

        Functions we can on strings
        ============================
len()	lower()	translate()	islower()
ljust()	upper()	startswith()	isupper()
rjust()	find()	endswith()	isnumeric()
center()	rfind()	isalnum()	isdecimal()
zfill()	index()	isalpha()	split()
strip()	rindex()	isdigit()	rsplit()
rstrip()	capitalize()	isspace()	partition()
lstrip()	swapcase()	istitle()	rpartition()

''')

        Functions we can on strings
        ============================
len()	lower()	translate()	islower()
ljust()	upper()	startswith()	isupper()
rjust()	find()	endswith()	isnumeric()
center()	rfind()	isalnum()	isdecimal()
zfill()	index()	isalpha()	split()
strip()	rindex()	isdigit()	rsplit()
rstrip()	capitalize()	isspace()	partition()
lstrip()	swapcase()	istitle()	rpartition()

In [17]:
names.str.lower()

0    peter parker
1         ravisha
2           preet
3         sanjana
4           arjun
dtype: object

In [18]:
names.str.len()

0    12
1     7
2     5
3     7
4     5
dtype: int64

In [19]:
names.str.startswith('p')

0     True
1    False
2     True
3    False
4    False
dtype: bool

In [20]:
names.str.split()

0    [peter, parker]
1          [ravisha]
2            [preet]
3          [sanjana]
4            [arjun]
dtype: object

In [21]:
print("""

         Methods used for regular expression
         ===================================
         match()
         extract()
         findall()
         replace()
         contains()
         count()
         split()
         rsplit()

""")

         Methods used for regular expression
         ===================================
         match()
         extract()
         findall()
         replace()
         contains()
         count()
         split()
         rsplit()

In [23]:
names.str.replace('a','A')

0    peter pArker
1         rAvishA
2           preet
3         sAnjAnA
4           Arjun
dtype: object

In [24]:
names.str.count('a')

0    1
1    2
2    0
3    3
4    1
dtype: int64

In [25]:
names.str.split('a')

0    [peter p, rker]
1        [r, vish, ]
2            [preet]
3       [s, nj, n, ]
4           [, rjun]
dtype: object

In [26]:
names.str[0:3]

0    pet
1    rav
2    pre
3    san
4    arj
dtype: object

In [27]:
names.str.split()

0    [peter, parker]
1          [ravisha]
2            [preet]
3          [sanjana]
4            [arjun]
dtype: object

In [28]:
names.str.split().get(-1)

In [29]:
names

0    peter parker
1         ravisha
2           preet
3         sanjana
4           arjun
dtype: object

In [32]:
data1 = pd.DataFrame({'name': names,
                           'info': ['B|C|D', 'B|D', 'A|C',
                                    'B|D', 'B|C']})
data1

           name   info
0  peter parker  B|C|D
1       ravisha    B|D
2         preet    A|C
3       sanjana    B|D
4         arjun    B|C

In [33]:
data1['info'].str.get_dummies('|')

   A  B  C  D
0  0  1  1  1
1  0  1  0  1
2  1  0  1  0
3  0  1  0  1
4  0  1  1  0

In [34]:
names.str.len().describe()

count     5.000000
mean      7.200000
std       2.863564
min       5.000000
25%       5.000000
50%       7.000000
75%       7.000000
max      12.000000
dtype: float64

In [40]:
names.str.contains('p').sum()

2

# you know Working with Time series is also there

In [47]:
from datetime import datetime
datetime(year=2015,month=7,day=4)

datetime.datetime(2015, 7, 4, 0, 0)

In [51]:
from dateutil import parser
date=parser.parse('4th july of 2023')

In [52]:
date.strftime('%A')

'Tuesday'

In [53]:
# for numpy use np.datetime64
np.datetime64('2015-07-04')

numpy.datetime64('2015-07-04')

In [55]:
np.datetime64('2023-10-04 09:44')

numpy.datetime64('2023-10-04T09:44')

In [56]:
np.datetime64('2023-10-04 09:44','ns')

numpy.datetime64('2023-10-04T09:44:00.000000000')

In [57]:
print("""

         date time functions shorts
         --------------------------
         
Y	Year
M	Month
W	Week
D	Day
h	Hour
m	Minute
s	Second	
ms	Millisecond
us	Microsecond
ns	Nanosecond
ps	Picosecond
fs	Femtosecond
as	Attosecond
""")

         date time functions shorts
         --------------------------

Y	Year
M	Month
W	Week
D	Day
h	Hour
m	Minute
s	Second
ms	Millisecond
us	Microsecond
ns	Nanosecond
ps	Picosecond
fs	Femtosecond
as	Attosecond

# Date and time in pandas

In [58]:
import pandas as pd
date=pd.to_datetime('4th of october,2023')

In [59]:
date

Timestamp('2023-10-04 00:00:00')

In [60]:
date.strftime('%A')

'Wednesday'

In [61]:
date.strftime('%M')

'00'

In [62]:
date.strftime('%m')

'10'

In [63]:
date.strftime('%y')

'23'

In [65]:
date.strftime('%Y')

'2023'

In [66]:
date.strftime('%D')

'10/04/23'

In [67]:
# we can use date_range
pd.date_range('2023-10-04','2023-10-14')

DatetimeIndex(['2023-10-04', '2023-10-05', '2023-10-06', '2023-10-07',
               '2023-10-08', '2023-10-09', '2023-10-10', '2023-10-11',
               '2023-10-12', '2023-10-13', '2023-10-14'],
              dtype='datetime64[ns]', freq='D')

In [68]:
pd.date_range('2015-07-03',periods=8) # periods will changes the day

DatetimeIndex(['2015-07-03', '2015-07-04', '2015-07-05', '2015-07-06',
               '2015-07-07', '2015-07-08', '2015-07-09', '2015-07-10'],
              dtype='datetime64[ns]', freq='D')

In [70]:
pd.date_range('2023-10-04',periods=8,freq='H') # freq range of hours

DatetimeIndex(['2023-10-04 00:00:00', '2023-10-04 01:00:00',
               '2023-10-04 02:00:00', '2023-10-04 03:00:00',
               '2023-10-04 04:00:00', '2023-10-04 05:00:00',
               '2023-10-04 06:00:00', '2023-10-04 07:00:00'],
              dtype='datetime64[ns]', freq='H')

In [72]:
pd.date_range('2023-10-04',periods=8,freq='M') # months

DatetimeIndex(['2023-10-31', '2023-11-30', '2023-12-31', '2024-01-31',
               '2024-02-29', '2024-03-31', '2024-04-30', '2024-05-31'],
              dtype='datetime64[ns]', freq='M')

In [73]:
print('''
Frequencies:
D - Calendar day
B - Business day
W - Weekly
M - Month end  ,BM
Q - Quarter end,BQ
A - year end
H - hours
T - minutes
S - seconds
L - milliseconds
U - microseconds
N - nanoseconds



''')

Frequencies:
D - Calendar day
B - Business day
W - Weekly
M - Month end  ,BM
Q - Quarter end,BQ
A - year end
H - hours
T - minutes
S - seconds
L - milliseconds
U - microseconds
N - nanoseconds

In [74]:
# if we use S after M,Q,A then they made month start,quartestart,year start
pd.date_range('2023-10-04',periods=8,freq='2H30T') # 2 hours and 30 minutes

DatetimeIndex(['2023-10-04 00:00:00', '2023-10-04 02:30:00',
               '2023-10-04 05:00:00', '2023-10-04 07:30:00',
               '2023-10-04 10:00:00', '2023-10-04 12:30:00',
               '2023-10-04 15:00:00', '2023-10-04 17:30:00'],
              dtype='datetime64[ns]', freq='150T')

In [75]:
pd.date_range('2023-10-04',periods=8,freq='D')

DatetimeIndex(['2023-10-04', '2023-10-05', '2023-10-06', '2023-10-07',
               '2023-10-08', '2023-10-09', '2023-10-10', '2023-10-11'],
              dtype='datetime64[ns]', freq='D')

# eval and query

In [79]:
df = pd.DataFrame(np.random.rand(1000, 3), columns=['A', 'B', 'C'])
df.head()

          A         B         C
0  0.510485  0.310361  0.434619
1  0.007353  0.173362  0.069437
2  0.045508  0.979067  0.262671
3  0.305224  0.105218  0.148749
4  0.297453  0.027507  0.939754

In [80]:
pd.eval('(df.A+df.B)')

0      0.820847
1      0.180715
2      1.024574
3      0.410442
4      0.324960
         ...
995    1.177996
996    1.730732
997    0.650962
998    1.754465
999    0.249560
Length: 1000, dtype: float64